package src;

/// TEST CLASS: DO NOT MODIFY

public class _$x7 {
    public Object[] ǂ = {ʃ("愛", "朝", "圧", "安", "暗", "案", "秋"), ʃ("部", "薔", "美", "文", "病", "別", "歩"), ʃ("木", "腰", "濃", "長", "地", "茶", "着"), ʃ("蔓", "殿", "代", "道", "弟", "田", "度"), ʃ("絵", "得", "円", "縁", "英", "永", "栄"), ʃ("服", "不", "富", "風", "深", "船", "封"), ʃ("具", "画", "五", "外", "限", "現", "原"), ʃ("矛", "府", "伏", "春", "話", "花", "半"), ʃ("居", "池", "岩", "以", "入", "石", "一"), ʃ("来", "字", "寺", "重", "自", "実", "時"), ʃ("黒", "県", "金", "火", "顔", "感", "界"), ʃ("蔵", "楽", "落", "流", "林", "理", "量"), ʃ("無", "森", "前", "満", "万", "松", "待"), ʃ("何", "乗", "年", "南", "内", "難", "日"), ʃ("桶", "尾", "音", "屋", "親", "横", "終"), ʃ("泊", "串", "平", "片", "品", "歩", "表"), ʃ("桑", "鍬", "球", "区", "久", "級", "旧"), ʃ("連", "列", "利", "理", "良", "料", "力"), ʃ("刺", "紗", "作", "色", "早", "声", "世"), ʃ("時", "炊", "食", "田", "手", "天", "体"), ʃ("右", "宇", "上", "後", "内", "海", "雨"), ʃ("分", "別", "辺", "変", "番", "便", "法"), ʃ("我", "若", "和", "輪", "分", "忘", "王"), ʃ("処", "修", "消", "匠", "小", "笑", "象"), ʃ("野", "湯", "山", "夜", "様", "洋", "要"), ʃ("全", "付", "在", "財", "前", "善", "税")};

    private static String ᄅ(String $) {
        return new String($.getBytes(), java.nio.charset.StandardCharsets.UTF_8);
    }

    private static String[] ʃ(String... $) {
        String[] ɸ = new String[$.length];
        for (int i = 0; i < $.length; i++) ɸ[i] = ᄅ($[i]);
        return ɸ;
    }

    public String[] ȸ(int i) {
        return (String[]) ǂ[i];
    }
}